[
    {
        "name": "\nParser aliexpress, ozon, wb,\n\navito\n",
        "price": "1 500 руб.за час",
        "date": "\n19 июля 2022, 11:14\n • \n5\n \nоткликов\n • \n58\n \nпросмотров\n\n\n\n\n",
        "tz": "\nТребуется разрабатывать и поддерживать парсера различных магазинов, разработка ведется под нашу инфраструктуру (redis, rabbitmq, protobuf, symfony), интересует реализация конкретно на php8 (много чего уже реализовано). Работа строго фултайм, если у вас нет времени или компетенции пропускайте.\n",
        "url": "https://freelance.habr.com//tasks/447109"
    },
    {
        "name": "\nВосстановить работу парсера отзывов на\n\nсайте\n",
        "price": "2 000 руб. за проект",
        "date": "\n18 июля 2022, 18:54\n • \n6\n \nоткликов\n • \n75\n \nпросмотров\n\n\n\n\n",
        "tz": "\nНеобходимо восстановить работу парсера отзывов на сайте. Сайт на Битрикс. Отзывы забираются с ЯндексКарт. Перестали обновляться по какой то причине.Огромная просьба откликаться исполнителям с реальным опытом веб разработки.\n",
        "url": "https://freelance.habr.com//tasks/447015"
    },
    {
        "name": "\nНаписание парсера объявлений недвижимости (Зарубежные\n\nсайты)\n",
        "price": "15 000 руб. за проект",
        "date": "\n18 июля 2022, 17:06\n • \n12\n \nоткликов\n • \n90\n \nпросмотров\n\n\n\n\n",
        "tz": "\nЗдравствуйте.Пожалуйста, прежде чем отвечать на заказ, внимательно дочитайте объявление до конца (и пишите мне в телеграм сразу, а не в комменты). И давайте сразу на \"ты\". Формализм ни к чему.Цена за парсер - не окончательная. Она основывается на вашей способности обосновать, почему 15, а не 10. или почему 7, а не 10. Экономить я не собираюсь, но нужна объективная оценка с вашей стороны.Оплата либо 50/50 на карту, либо после того, как скинете 100% выгрузку с сайта, чтобы мы видели, что всё работает.Заказы размещаю от лица компании. Мы активно расширяем сферу деятельности, поэтому каждые 3-5 недель будет появляться запрос на всё новые и новые парсеры.Суть: по мере расширения на зарубежные рынки (Вьетнам, Таиланд, ОАЭ, Турция и т.д.) для наполнения собственной базы данных нам нужна статистика по объёму предложения и ценообразованию на рынке недвижимости отдельно взятой страны. 2 месяца назад я уже нашёл на Хабре одного человека. Одного теперь недостаточно. Заказов на разные сайты много. Нужны ещё люди.В данный момент в первую очередь интересуют сайты с недвижимостью Таиланда. Любой сайт мной оценивается в первую очередь на информационную ёмкость: сколько суммарно объявлений на сдачу в арену, сколько - на продажу, насколько полная информация содержится в карточках объектах. В идеале нужно для каждой страны присутствия найти сайт с максимумом информации. Пример выгрузки с недвижимостью ОАЭ, которую мы уже парсим, прикрепляю к заказу. Примерно то же самое нужно будет нам и для новых сайтов.Есть 3 сайта (сайт №1 на тайском, сайты №2,3 на английском).Первым этапом нужно выяснить, на каком из 3 сайтов больше \"живых\" объявлений. Вроде как, сайты 2 и 3 - врут. Если фаворитом останется сайт №1, к нему нужно будет прикрутить автоматический перевод с тайского на английский.1. https://www.ddproperty.com/en/property-for-sale?ma...Есть 2 сайта похуже (но они на английском):2. https://www.hipflat.com/listings/phuket-house-osak...3. https://www.thailand-property.com/properties-for-s...Парсинг нужно будет настроить на загрузку в PostgreSQL. Это обязательное требование.Пишите мне в телегу:1. Опыт парсинга. Спрашиваю, потому что нужно будет делать быстро и хорошо (не за дешево), и времени растягивать заказ на 2 недели у нас не будет. - c примерами сайтов, которые приходилось парсить.2. Знаете ли способы в автоматическом режиме как-то переводить сайт #1 на англ. Если нет, см след. пункт3. На каком из сайтов 1, 2,3 больше РЕАЛЬНЫХ объявлений.4. Стоимость написания парсера.5. Сроки написания парсера.6. Какая форма оплаты для вас приемлема.7. Готовы ли будете работать с нами в долгосрок и, если что, за доп плату дописывать свои же парсеры в случае, если что-то сломается.8. Если \"что-то сломается\" через неделю после того, как вы нам сдадите парсер, готовы ли будете его бесплатно доделать. И если да, то вообще в течение какого времени можете доработать своё детище бесплатно в случае возникновения проблем.ник тг:bleed01904\n",
        "url": "https://freelance.habr.com//tasks/446985"
    },
    {
        "name": "\nСделать парсер авито.\n\nPython\n",
        "price": "15 000 руб. за проект",
        "date": "\n18 июля 2022, 13:15\n • \n28\n \nоткликов\n • \n150\n \nпросмотров\n\n\n\n\n",
        "tz": "\nСделать парсер авито, раздел недвижимость.Нужно выкачать все существующие объявления и мониторить новые объявленияДанные записывать в postgresСкрипт должен быть запущен в докере; selenium в режиме headlessСтрого на Pythonв отклике укажите телеграм\n",
        "url": "https://freelance.habr.com//tasks/446925"
    },
    {
        "name": "\nНаписать сайт с данными с других\n\nсайтов\n",
        "price": "10 000 руб. за проект",
        "date": "\n17 июля 2022, 19:08\n • \n11\n \nоткликов\n • \n145\n \nпросмотров\n\n\n\n\n",
        "tz": "\n1)Нужно взять 3 блока с разных сайтов ниже скриншоты и ссылки на сайты откуда данные братьтзhttps://docs.google.com/document/d/1XIBbDGr6Ws_JPfUnUf1WtdNWK4_frjDReBmafdhUcHw/edit?usp=sharing1 и 3 сайт обновляются раз в сутки. 2 сайт можно сделать с задержкой на 3-5 секунд котировки.1.2 сайт работают по API, 3 сайт без Apihttps://tradingeconomics.com/analytics/pricing.aspx?source=developerhttps://ru.tradingview.com/tradingview-for-the-web/\n",
        "url": "https://freelance.habr.com//tasks/446843"
    },
    {
        "name": "\nНужен парсер на\n\nBestchange\n",
        "price": "20",
        "date": "\n14 июля 2022, 20:13\n • \n20\n \nоткликов\n • \n126\n \nпросмотров\n\n\n\n\n",
        "tz": "\nНужно взять мой АПИ Бинанс и  мой АПИ Бэстченж\nнеобходимо сравнивать 60-70 монет на Бинансе и на Бэсченже в различных комбинациях.\nТакже необходимо обернуть парсер в телеграм-бота\nПо запросу, бот производит расчет (секунд 15-20) и выдает ТОП-10 или 20 вариантов\n+ нужен белый список участников\n+ холд на запрос 15-20 сек.\n___\nВ отклике указывайте контакт телеграм или дискорд\n",
        "url": "https://freelance.habr.com//tasks/446467"
    },
    {
        "name": "\nСделать парсер\n\nданных\n",
        "price": "37",
        "date": "\n13 июля 2022, 10:10\n • \n37\n \nоткликов\n • \n151\n \nпросмотр\n\n\n\n\n",
        "tz": "\nЕсть парсер, но он перестал работать, или исправить или проще новый сделать.\nИз таких данных \n\nDialogue: 0,0:00:00.00,0:00:01.76,Default,,0,0,0,,Юлчы бирешми, \nDialogue: 0,0:00:01.76,0:00:03.53,Default,,0,0,0,,бишмәтен төймәләп, \nDialogue: 0,0:00:03.53,0:00:06.05,Default,,0,0,0,,билен ныгытып буып куя. \nDialogue: 0,0:00:06.05,0:00:07.33,Default,,0,0,0,,Шунда Җил \nDialogue: 0,0:00:07.33,0:00:08.53,Default,,0,0,0,,бу кешенең \nDialogue: 0,0:00:08.53,0:00:09.72,Default,,0,0,0,, киемен салдыра \nDialogue: 0,0:00:09.72,0:00:11.72,Default,,0,0,0,,алмаячагын аңлый.\n\nнадо получить\n        { word: \"Юлчы бирешми, \", start: \"0\" },\n        { word: \"бишмәтен төймәләп, \", start: \"1760\" },\n        { word: \"билен ныгытып буып куя. \", start: \"3530\" },\n        { word: \"Шунда Җил \", start: \"6050\" },\n        { word: \"бу кешенең \", start: \"7330\" },\n        { word: \"киемен салдыра \", start: \"8530\" },\n        { word: \"алмаячагын аңлый. \", start: \"9720\" },\n",
        "url": "https://freelance.habr.com//tasks/446113"
    },
    {
        "name": "\nПарсер. Перенос данных из ПДФ файлов в\n\nExcel\n\n",
        "price": "40 000 руб. за проект",
        "date": "\n11 июля 2022, 21:03\n • \n37\n \nоткликов\n • \n239\n \nпросмотров\n\n\n\n\n",
        "tz": "\nНеобходимо разработать парсера данных их ПДФ файлов. Определенные колонки из таблиц в файлах вставлять в макросы Excel, формат таблиц в ПДФ файлах различается и нужно структурировать данные из каждого файла в формат макросов Excel. Вводные по макросам я структурированно выдам\n",
        "url": "https://freelance.habr.com//tasks/445857"
    },
    {
        "name": "\nРазработать бота телеграм с парсером\n\nбукмекера\n",
        "price": "5 000 руб. за проект",
        "date": "\n09 июля 2022, 10:41\n • \n19\n \nоткликов\n • \n144\n \nпросмотра\n\n\n\n\n",
        "tz": "\nНеобходимо парсить матчи по определенным условиям (как в лайве так и линию и отдельно).При совпадении условий необходимо отправлять сообщение в ТГ бот. Необходимо иметь возможность подключать бота админом в ТГ-каналыВ отклике укажите стек и опыт.Студии нге интересуют\n",
        "url": "https://freelance.habr.com//tasks/445471"
    },
    {
        "name": "\nПарсер контента на Java\n\nSpring\n",
        "price": "16",
        "date": "\n08 июля 2022, 12:01\n • \n16\n \nоткликов\n • \n74\n \nпросмотра\n\n\n\n\n",
        "tz": "\nНаписать парсер Java Spring  для парсинга вебархива и обработки контента. Подробнее ТЗ при переписке\n",
        "url": "https://freelance.habr.com//tasks/445319"
    },
    {
        "name": "\nНаписать софт парсер (цену назовите\n\nсами)\n\n",
        "price": "3 000 руб. за проект",
        "date": "\n07 июля 2022, 15:03\n • \n8\n \nоткликов\n • \n223\n \nпросмотра\n\n\n\n\n",
        "tz": "\nУ нас есть список из сайтов/каталогов, где публикуются новые крипто проекты:Ico / ieo / sto / defi / gamefi / play2earn / move2earn / metaverse / web3.0Т.е. по каждому направлению есть несколько сайтов с которых бот будет парсить данные по проектамПример:данные по проектам ico софт парсит с этих сайтов Icoholder.com / icobench.com / icodrops.comБот залетает на сайт проекта, парсит:1) email2) если указана ссылка на линкедин, то он парсит ссылки на сотрудников в линкедыне3) Ищет на сайте телеграм и дискорд чаты, парсит из них ники админов4) выплевывает в чате (телеграмме) сообщение:Найден новый лид:Домен ......Имейл ......Ссылки на линкедин профили......Ссылки телеграм и дискорд чаты.....Ники админов........При отклике, просьба скидывать1) портфолио2) предварительную цену3) срок выполнения\n",
        "url": "https://freelance.habr.com//tasks/445163"
    },
    {
        "name": "\n\nПарсер\n",
        "price": "8",
        "date": "\n06 июля 2022, 16:43\n • \n8\n \nоткликов\n • \n149\n \nпросмотров\n\n\n\n\n",
        "tz": "\nНаписать парсер на Spring для парсинга вебархива. Проект сложный, пишите пожалуйста если есть опыт работы с вебархивом.\n",
        "url": "https://freelance.habr.com//tasks/444967"
    },
    {
        "name": "\nПарсинг тг групп, уведомлять по ключевикам, собирать\n\nстату\n",
        "price": "18",
        "date": "\n06 июля 2022, 14:30\n • \n18\n \nоткликов\n • \n89\n \nпросмотров\n\n\n\n\n",
        "tz": "\nЕсть группы в тг, типаhttps://t.me/hiber_kaker_mondayhttps://t.me/iproxy_support_ruВ группах юзеры задают вопросы. Я хочу видеть когда юзер спрашивает мое ключевое слово.Необходимый функционал:1. Куда можно добавить тг чаты. Чатов много, список будет пополняться. Есть закрытые чаты, куда вход доступен после модерации (нужно ввести капчу или написать админу)2. Куда можно добавить ключевые слова3. Таблица со столбцами: Дата, ключевое слово, чат, сообщение, тг автора сообшения4. Нужно уведомлять, когда появляется новая запись в таблице\n",
        "url": "https://freelance.habr.com//tasks/444925"
    },
    {
        "name": "\nНаписать парсер под\n\nзадачу\n",
        "price": "20 000 руб. за проект",
        "date": "\n05 июля 2022, 11:03\n • \n25\n \nоткликов\n • \n137\n \nпросмотров\n\n\n\n\n",
        "tz": "\nДобрый день, коллеги!Нужен двелопер с хорошим знанием php, который поможет написать парсер данных с аукциона.\n",
        "url": "https://freelance.habr.com//tasks/444629"
    },
    {
        "name": "\nРазработать парсер с простым интерфейсом для мониторинга\n\nцен\n",
        "price": "40 000 руб. за проект",
        "date": "\n04 июля 2022, 10:11\n • \n43\n \nотклика\n • \n197\n \nпросмотров\n\n\n\n\n",
        "tz": "\nЦель: выгружать цены с нескольких Дубайских маркетплейсовСайты: https://www.amazon.ae/ (выбрать город доставки Дубай)https://www.noon.com/ (открывается только с VPN, выбрать город доставки Дубай)https://www.carrefouruae.com/mafuae/en/ (выбрать город доставки Дубай)https://www.dubaistore.com/https://www.mumzworld.com/en/ (выбрать страну UAE и цены в AED)https://uae.sharafdg.com/ (выбрать страну UAE)ТУ:Результат нужно получать в таблице Excel.Автоматическое сохранение всех цен ежедневно (будем собирать историю изменения цены, нужно сохранить как цену продажи, так и цену до скидки (зачеркнутую цену) - можно сделать автоматическую выгрузку таблицы)Автоматическая выгрузка/отправка по почте отчета с ценами по расписанию (раз в три дня).Возможность выгрузить отчет просто по запросу Возможность добавления новых товаров для мониторинга и удаления неактуальных, замена ссылок в уже загруженных товарах.Хранение информации о товарах с привязкой к артикулам (их также нужно выгружать в отчеты).Вводить изменения в список товаров и ссылок для парсинга импортом Excel- таблицы.Кнопка Обновить цены и кнопка Выгрузить отчет.Товаров для мониторинга будет около 1500 (пока 700)Есть возможность купить прокси, но буду рада советам по его выбору.\n",
        "url": "https://freelance.habr.com//tasks/444435"
    },
    {
        "name": "\nПарсер цен с\n\nкриптобирж\n",
        "price": "7 000 руб. за проект",
        "date": "\n01 июля 2022, 23:23\n • \n41\n \nотклик\n • \n146\n \nпросмотров\n\n\n\n\n",
        "tz": "\nПарсер цен p2p с криптобирж в таблицу\n",
        "url": "https://freelance.habr.com//tasks/444211"
    },
    {
        "name": "\nНаписать\n\nпарсер\n",
        "price": "20 000 руб. за проект",
        "date": "\n01 июля 2022, 20:33\n • \n21\n \nотклик\n • \n290\n \nпросмотров\n\n\n\n\n",
        "tz": "\nЕсть страницы типа:\nhttps://www.similarweb.com/website/habr.com   (вместо habr может быть любой домен)\n\nНеобходимо написать парсер с обходом Perimetr X\nНужно парсить 500к страниц в сутки\n\nЖелательно на node js\n",
        "url": "https://freelance.habr.com//tasks/444193"
    },
    {
        "name": "\nИсправить баги в парсере\n\nphp/selenium\n",
        "price": "1 600 руб. за проект",
        "date": "\n01 июля 2022, 15:05\n • \n6\n \nоткликов\n • \n81\n \nпросмотр\n\n\n\n\n",
        "tz": "\nТребуется исправить баги в работающем парсере Ebay.com согласно списка: https://docs.google.com/spreadsheets/d/1i9dv2QNXEC...Парсер написан на php, интегрирован в веб проект (php) и работает через selenium.\n",
        "url": "https://freelance.habr.com//tasks/444155"
    },
    {
        "name": "\nСпарсить выдачу яндекс\n\nкарт\n\n",
        "price": "5 000 руб. за проект",
        "date": "\n30 июня 2022, 08:36\n • \n27\n \nоткликов\n • \n142\n \nпросмотра\n\n\n\n\n",
        "tz": "\nНеобходимо спарсить все результаты по запросу \"ломбард\" по городу Москва. На выходе должен быть json или любой другой читаемый компьютером формат.Нужны следующие данные: 1) Название организации2) Адрес и координаты3) Средняя оценка и список всех отзывов вместе с картинками4) Все фотографии(ссылки на них)5) График работы6) Вся контактная информация - телефоны, соцсети, сайты и прочее\n",
        "url": "https://freelance.habr.com//tasks/443869"
    },
    {
        "name": "\nДоработка парсера\n\nДирект\n",
        "price": "8",
        "date": "\n29 июня 2022, 20:32\n • \n8\n \nоткликов\n • \n83\n \nпросмотра\n\n\n\n\n",
        "tz": "\nДобрый день,Написан основной механизм на pyton, ищу человека, работавшего с парсерами Директ, чтобы закончить работу. Парсим ключевые слова с частотностями. Выводим в HTML результат пользователю, особой верстки и красоты пока не надо. Ориентировочно, осталось от 2 до 5 часов работы. Первоначальная версия уже работает на VPS. Будет преимуществом, если был опыт работы с ограничениями по количеству запросов. В отклике, пожалуйста, укажите цену за час работы и контакты в телеграм.\n",
        "url": "https://freelance.habr.com//tasks/443831"
    },
    {
        "name": "\nНастроить парсер api поставщика в модуле kitnet.import для\n\n1с-битрикс\n",
        "price": "2",
        "date": "\n29 июня 2022, 00:58\n • \n2\n \nотклика\n • \n22\n \nпросмотра\n\n\n\n\n",
        "tz": "\nНастроить парсер api поставщика в модуле kitnet.import для 1с-битрикс\n\n",
        "url": "https://freelance.habr.com//tasks/443661"
    },
    {
        "name": "\nДоменная почта для кириллических\n\nдоменов\n",
        "price": "2 000 руб. за проект",
        "date": "\n28 июня 2022, 09:07\n • \n3\n \nотклика\n • \n71\n \nпросмотр\n\n\n\n\n",
        "tz": "\nЦель - подключение корпоративной почты для .рф доменов в AmoCRM и пересылка на парсер Амо некоторых писемЗадача:- поднять на VDS почтовый сервер- создать по 1 адресу для 2 .рф доменов- настроить 2 правила пересылки писем (по отправителю и содержанию ключей в Теме)Вопросы:- какой программный пакет используете для решения?- как будет обеспечена стабильность работы, контроль недоставленных/неполученных писем?\n",
        "url": "https://freelance.habr.com//tasks/443455"
    },
    {
        "name": "\nСоздать парсер для поисковой\n\nвыдачи\n",
        "price": "30 000 руб. за проект",
        "date": "\n28 июня 2022, 01:33\n • \n12\n \nоткликов\n • \n180\n \nпросмотров\n\n\n\n\n",
        "tz": "\nНужно реализовать http клиента (на php), который будет принимать запрос поисковой системы Яндекса (Например: ремонт холодильников), и параметр региональности (например: 213 (москва)) и проксю. В ответ должно приходить html поисковой выдачи Яндекса. Так же нужно уделить внимание на частоту запросов, чтобы при большом количестве запросов яндекс не выдавал капчу.Примерные объемы обработки 25 тыс. запросов в час\n",
        "url": "https://freelance.habr.com//tasks/443425"
    },
    {
        "name": "\nДоработать парсер или\n\nпереписать\n",
        "price": "24",
        "date": "\n27 июня 2022, 17:05\n • \n24\n \nотклика\n • \n160\n \nпросмотров\n\n\n\n\n",
        "tz": "\nЕсть работающий парсер справочника организаций самого известного поисковика. Написан на Delphi/Pascal, Rad Studio 10.3 Rio, исходники парсера есть. Нужно доработать парсер - внести изменение в существующие фильтры поиска организаций, либо переписать сам парсер на другом языке.\n",
        "url": "https://freelance.habr.com//tasks/443355"
    },
    {
        "name": "\nСбор / парсер фотографий из Google\n\nпанорам\n\n",
        "price": "20 000 руб. за проект",
        "date": "\n24 июня 2022, 12:41\n • \n18\n \nоткликов\n • \n253\n \nпросмотра\n\n\n\n\n",
        "tz": "\nПредлагайте стоимость и сроки.Задача: нужен скрипт по получению jpeg картинок из панорам с Google Street View. Фотографии собираются относительно входных точек, где это возможно. Фотографии собираются в некоторой окрестности от искомой точки.Входные данные:- csv файл со списком точек (примерно 50000-100000 шт) с координатами. Id точки, широта, долготаВыходные данные:- Массив jpeg фотографий в виде ссылок для возможных точекТребование к фотографиям:- Разрешение изображений до 3000 пикселей по ширине/ высоте- Без обработки, jpeg формат изображения- Без каких-либо графических и пользовательских элементов, пинов, стрелок, подписей, указателей гугла и тд. Чистая фотография, максимум блюр лиц и номерных знаков- Фотография в максимальном возможном отдалении панорамы, без наклона по горизонту- Фотографии необходимо загрузить в object Storage Yandex Cloud, дам ключ доступа после демонстрации примера- На выходе каждое изображение доступно в виде публичной url ссылки Описание алгоритма сбора (визуализация в прикрепленном файле):- Смотрим, доступна ли Google-панорама в менее чем 20 метрах от координат искомой точки- Если панорам рядом нет, то пропускаем- Если панорама рядом есть, то перемещаемся по ближайшей возможной улице/улицам с минимальным возможным шагом в пределах тех же 20 метров, собираем направленные фотографии на точку со всех возможных ракурсов- Сохраняем фотографии и формируем ссылки- Записываем полученные ссылки для точкиНа выходе от вас нужен: - исходный csv-файл с добавленными массивами фотографий для точек, где панорама есть- Воспроизводимый скрипт (любой ЯП и решение). Для проверки работоспособности скрипта нужна будет краткая инструкция по запуску, либо созвон через zoomОбратите внимание, в интернете есть готовые решения по типу StreetView Grabber и др. Возможно, они существенно упростят задачу\n",
        "url": "https://freelance.habr.com//tasks/442927"
    }
]